-- MySQL dump 10.13  Distrib 8.0.43, for Linux (x86_64)
--
-- Host: localhost    Database: localkeiba
-- ------------------------------------------------------
-- Server version       8.0.43-0ubuntu0.24.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `baba`
--

DROP TABLE IF EXISTS `baba`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `baba` (
  `baba_code` tinyint NOT NULL DEFAULT '0',
  `baba_name` text COLLATE utf8mb3_unicode_ci,
  `rakuten_baba_code` char(4) COLLATE utf8mb3_unicode_ci DEFAULT NULL COMMENT '楽天競馬のトラック4桁（例：盛岡=1006、金沢=2218、高知=3129）'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `baba`
--

LOCK TABLES `baba` WRITE;
/*!40000 ALTER TABLE `baba` DISABLE KEYS */;
INSERT INTO `baba` VALUES (1,'北見ば',NULL),(2,'岩見ば',NULL),(3,'帯広ば','0304'),(4,'旭川ば',NULL),(7,'旭川',NULL),(8,'札幌',NULL),(10,'盛岡','1006'),(11,'水沢','1106'),(12,'上山',NULL),(15,'足利',NULL),(16,'宇都宮',NULL),(17,'高崎',NULL),(18,'浦和','1800'),(19,'船橋','1914'),(20,'大井','2015'),(21,'川崎','2135'),(22,'金沢','2218'),(23,'笠松','2300'),(24,'名古屋','2400'),(25,'中京',NULL),(27,'園田','2726'),(28,'姫路','2800'),(30,'福山',NULL),(31,'高知','3129'),(32,'佐賀','3230'),(33,'荒尾',NULL),(36,'門別','3600'),(41,'ばんえ',NULL),(42,'北海道',NULL),(43,'岩手',NULL),(44,'新潟',NULL),(45,'北関東',NULL),(46,'南関東',NULL),(47,'栃木',NULL),(48,'東海',NULL),(49,'愛知',NULL),(50,'兵庫',NULL),(61,'九州',NULL),(80,'全国',NULL);
/*!40000 ALTER TABLE `baba` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `calendar`
--

DROP TABLE IF EXISTS `calendar`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `calendar` (
  `race_date` date NOT NULL,
  `venucode` int NOT NULL,
  `venue` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`race_date`,`venucode`),
  KEY `idx_calendar_race_date` (`race_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `calendar`
--

LOCK TABLES `calendar` WRITE;
/*!40000 ALTER TABLE `calendar` DISABLE KEYS */;
INSERT INTO `calendar` VALUES ('2025-10-01',19,'船橋'),('2025-10-01',24,'名古屋'),('2025-10-01',27,'園田'),('2025-10-01',36,'門別'),('2025-10-02',19,'船橋'),('2025-10-02',24,'名古屋'),('2025-10-02',27,'園田'),('2025-10-02',36,'門別'),('2025-10-03',19,'船橋'),('2025-10-03',24,'名古屋'),('2025-10-03',27,'園田'),('2025-10-04',31,'高知'),('2025-10-04',32,'佐賀'),('2025-10-05',11,'水沢'),('2025-10-05',20,'大井'),('2025-10-05',31,'高知'),('2025-10-05',32,'佐賀'),('2025-10-06',11,'水沢'),('2025-10-06',20,'大井'),('2025-10-06',22,'金沢'),('2025-10-07',11,'水沢'),('2025-10-07',20,'大井'),('2025-10-07',22,'金沢'),('2025-10-07',23,'笠松'),('2025-10-07',36,'門別'),('2025-10-08',20,'大井'),('2025-10-08',23,'笠松'),('2025-10-08',27,'園田'),('2025-10-08',36,'門別'),('2025-10-09',20,'大井'),('2025-10-09',23,'笠松'),('2025-10-09',27,'園田'),('2025-10-09',36,'門別'),('2025-10-10',20,'大井'),('2025-10-10',23,'笠松'),('2025-10-10',27,'園田'),('2025-10-11',22,'金沢'),('2025-10-11',31,'高知'),('2025-10-11',32,'佐賀'),('2025-10-12',10,'盛岡'),('2025-10-12',22,'金沢'),('2025-10-12',31,'高知'),('2025-10-12',32,'佐賀'),('2025-10-13',10,'盛岡'),('2025-10-13',21,'川崎'),('2025-10-13',32,'佐賀'),('2025-10-14',10,'盛岡'),('2025-10-14',21,'川崎'),('2025-10-14',22,'金沢'),('2025-10-14',24,'名古屋'),('2025-10-14',36,'門別'),('2025-10-15',21,'川崎'),('2025-10-15',24,'名古屋'),('2025-10-15',27,'園田'),('2025-10-15',36,'門別'),('2025-10-16',21,'川崎'),('2025-10-16',24,'名古屋'),('2025-10-16',27,'園田'),('2025-10-16',36,'門別'),('2025-10-17',21,'川崎'),('2025-10-17',24,'名古屋'),('2025-10-17',27,'園田'),('2025-10-18',31,'高知'),('2025-10-18',32,'佐賀'),('2025-10-19',10,'盛岡'),('2025-10-19',22,'金沢'),('2025-10-19',31,'高知'),('2025-10-19',32,'佐賀'),('2025-10-20',10,'盛岡'),('2025-10-20',20,'大井'),('2025-10-21',10,'盛岡'),('2025-10-21',20,'大井'),('2025-10-21',22,'金沢'),('2025-10-21',23,'笠松'),('2025-10-21',36,'門別'),('2025-10-22',20,'大井'),('2025-10-22',23,'笠松'),('2025-10-22',27,'園田'),('2025-10-22',36,'門別'),('2025-10-23',20,'大井'),('2025-10-23',23,'笠松'),('2025-10-23',27,'園田'),('2025-10-23',36,'門別'),('2025-10-24',20,'大井'),('2025-10-24',23,'笠松'),('2025-10-24',27,'園田'),('2025-10-25',22,'金沢'),('2025-10-25',31,'高知'),('2025-10-25',32,'佐賀'),('2025-10-26',10,'盛岡'),('2025-10-26',31,'高知'),('2025-10-26',32,'佐賀'),('2025-10-27',10,'盛岡'),('2025-10-27',18,'浦和'),('2025-10-27',22,'金沢'),('2025-10-27',32,'佐賀'),('2025-10-28',10,'盛岡'),('2025-10-28',18,'浦和'),('2025-10-28',22,'金沢'),('2025-10-28',24,'名古屋'),('2025-10-28',27,'園田'),('2025-10-28',36,'門別'),('2025-10-29',18,'浦和'),('2025-10-29',24,'名古屋'),('2025-10-29',27,'園田'),('2025-10-29',36,'門別'),('2025-10-30',18,'浦和'),('2025-10-30',24,'名古屋'),('2025-10-30',27,'園田'),('2025-10-30',36,'門別'),('2025-10-31',18,'浦和'),('2025-10-31',24,'名古屋');
/*!40000 ALTER TABLE `calendar` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jockey_ranking`
--

DROP TABLE IF EXISTS `jockey_ranking`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `jockey_ranking` (
  `year` int NOT NULL,
  `jockey_name` varchar(255) NOT NULL,
  `score` int NOT NULL,
  PRIMARY KEY (`year`,`jockey_name`),
  KEY `idx_year` (`year`),
  KEY `idx_score` (`score`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jockey_ranking`
--

LOCK TABLES `jockey_ranking` WRITE;
/*!40000 ALTER TABLE `jockey_ranking` DISABLE KEYS */;
INSERT INTO `jockey_ranking` VALUES (2025,'山本 咲希到',1),(2025,'達城 龍次',2),(2025,'竹村 達也',3),(2025,'大山 龍太郎',4),(2025,'宮内 勇樹',5),(2025,'城野 慈尚',6),(2025,'及川 裕一',7),(2025,'佐野 遥久',8),(2025,'村上 忍',9),(2025,'山崎 誠士',10),(2025,'大柿 一真',11),(2025,'大山 真吾',12),(2025,'木之前 葵',13),(2025,'畑中 信司',14),(2025,'阿部 英俊',15),(2025,'本橋 孝太',16),(2025,'安藤 洋一',17),(2025,'小林 凌',18),(2025,'村上 弘樹',19),(2025,'佐々木 志音',20),(2025,'高木 健',21),(2025,'新庄 海誠',22),(2025,'山崎 雅由',23),(2025,'川原 正一',24),(2025,'友森 翔太郎',25),(2025,'竹吉 徹',26),(2025,'岡 遼太郎',27),(2025,'福原 杏',28),(2025,'加茂 飛翔',29),(2025,'藤田 凌',30),(2025,'出水 拓人',31),(2025,'田野 豊三',32),(2025,'高橋 愛叶',33),(2025,'長谷川 蓮',34),(2025,'岡村 卓弥',35),(2025,'鈴木 祐',36),(2025,'土方 颯太',37),(2025,'岡村 健司',38),(2025,'長谷部 駿弥',39),(2025,'岩本 怜',40),(2025,'金山 昇馬',41),(2025,'明星 晴大',42),(2025,'鴨宮 祥行',43),(2025,'杉浦 健太',44),(2025,'岩橋 勇二',45),(2025,'笹田 知宏',46),(2025,'細川 智史',47),(2025,'大畑 雅章',48),(2025,'柴田 勇真',49),(2025,'大畑 慧悟',50),(2025,'張田 昂',51),(2025,'高橋 悠里',52),(2025,'服部 茂史',53),(2025,'吉井 章',54),(2025,'町田 直希',55),(2025,'山本 聡紀',56),(2025,'宮下 瞳',57),(2025,'山中 悠希',58),(2025,'菅原 辰徳',59),(2025,'加藤 翔馬',60),(2025,'塚本 涼人',61),(2025,'多田羅 誠也',62),(2025,'栗原 大河',63),(2025,'阿部 龍',64),(2025,'西 啓太',65),(2025,'井上 瑛太',66),(2025,'和田 譲治',67),(2025,'桑村 真明',68),(2025,'岡部 誠',69),(2025,'青柳 正義',70),(2025,'丸野 勝虎',71),(2025,'石川 慎将',72),(2025,'小野 楓馬',73),(2025,'山田 義貴',74),(2025,'今井 貴大',75),(2025,'筒井 勇介',76),(2025,'下原 理',77),(2025,'赤岡 修次',78),(2025,'御神本 訓史',79),(2025,'本田 正重',80),(2025,'飛田 愛斗',81),(2025,'山本 政聡',82),(2025,'加藤 聡一',83),(2025,'吉村 智洋',84),(2025,'山口 勲',85),(2025,'永森 大智',86),(2025,'吉原 寛人',87),(2025,'高松 亮',88),(2025,'落合 玄太',89),(2025,'中島 龍也',90),(2025,'廣瀬 航',91),(2025,'渡邊 竜也',92),(2025,'野畑 凌',93),(2025,'望月 洵輝',94),(2025,'小牧 太',95),(2025,'山本 聡哉',96),(2025,'石川 倭',97),(2025,'塚本 征吾',98),(2025,'矢野 貴之',99),(2025,'笹川 翼',100);
/*!40000 ALTER TABLE `jockey_ranking` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prediction`
--

DROP TABLE IF EXISTS `prediction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prediction` (
  `prediction_id` bigint NOT NULL AUTO_INCREMENT,
  `race_id` bigint NOT NULL,
  `model_version` varchar(32) DEFAULT NULL,
  `memo` json NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`prediction_id`),
  UNIQUE KEY `uq_prediction_race_model` (`race_id`,`model_version`),
  KEY `idx_prediction_race` (`race_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prediction`
--

LOCK TABLES `prediction` WRITE;
/*!40000 ALTER TABLE `prediction` DISABLE KEYS */;
INSERT INTO `prediction` VALUES (3,202510130110,'yosou-v1','{\"best\": {\"score\": 128, \"breakdown\": {\"sire\": 0, \"custom\": 32, \"jockey\": 96}, \"horse_name\": \"スマイルバニラ\", \"horse_number\": 2}, \"items\": [{\"score\": 128, \"breakdown\": {\"sire\": 0, \"custom\": 32, \"jockey\": 96}, \"horse_name\": \"スマイルバニラ\", \"horse_number\": 2}, {\"score\": 118, \"breakdown\": {\"sire\": 0, \"custom\": 30, \"jockey\": 88}, \"horse_name\": \"ノーブルアイル\", \"horse_number\": 3}, {\"score\": 91, \"breakdown\": {\"sire\": 0, \"custom\": 30, \"jockey\": 61}, \"horse_name\": \"ラセーヌ\", \"horse_number\": 11}, {\"score\": 89, \"breakdown\": {\"sire\": 0, \"custom\": 30, \"jockey\": 59}, \"horse_name\": \"アイドルフェスタ\", \"horse_number\": 1}, {\"score\": 52, \"breakdown\": {\"sire\": 0, \"custom\": 34, \"jockey\": 18}, \"horse_name\": \"ソノバシノギ\", \"horse_number\": 4}, {\"score\": 40, \"breakdown\": {\"sire\": 0, \"custom\": 40, \"jockey\": 0}, \"horse_name\": \"ダンストンローザ\", \"horse_number\": 10}, {\"score\": 38, \"breakdown\": {\"sire\": 0, \"custom\": 38, \"jockey\": 0}, \"horse_name\": \"グローブミッション\", \"horse_number\": 8}, {\"score\": 36, \"breakdown\": {\"sire\": 0, \"custom\": 36, \"jockey\": 0}, \"horse_name\": \"シプレーノート\", \"horse_number\": 6}, {\"score\": 36, \"breakdown\": {\"sire\": 0, \"custom\": 0, \"jockey\": 36}, \"horse_name\": \"キタスクワート\", \"horse_number\": 9}, {\"score\": 30, \"breakdown\": {\"sire\": 0, \"custom\": 30, \"jockey\": 0}, \"horse_name\": \"メモリーメイラード\", \"horse_number\": 5}, {\"score\": 30, \"breakdown\": {\"sire\": 0, \"custom\": 30, \"jockey\": 0}, \"horse_name\": \"ファータフィオーレ\", \"horse_number\": 7}], \"model\": \"yosou-v1\", \"race_id\": \"202510130110\", \"generatedAt\": \"2025-10-12T22:00:08.285Z\"}','2025-10-12 22:00:08');
/*!40000 ALTER TABLE `prediction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prediction_eval`
--

DROP TABLE IF EXISTS `prediction_eval`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prediction_eval` (
  `race_id` char(12) NOT NULL,
  `model_version` varchar(64) NOT NULL,
  `predicted_horse_number` tinyint DEFAULT NULL,
  `win_hit` tinyint(1) NOT NULL DEFAULT '0',
  `win_payout` int DEFAULT NULL,
  `place_hit` tinyint(1) NOT NULL DEFAULT '0',
  `place_payout` int DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`race_id`,`model_version`),
  KEY `idx_prediction_eval_model` (`model_version`,`race_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prediction_eval`
--

LOCK TABLES `prediction_eval` WRITE;
/*!40000 ALTER TABLE `prediction_eval` DISABLE KEYS */;
INSERT INTO `prediction_eval` VALUES ('202510130110','yosou-v1',2,0,NULL,1,160,'2025-10-13 01:14:55','2025-10-13 02:14:14');
/*!40000 ALTER TABLE `prediction_eval` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prediction_roi`
--

DROP TABLE IF EXISTS `prediction_roi`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prediction_roi` (
  `race_id` char(12) NOT NULL,
  `model_version` varchar(64) NOT NULL,
  `strategy` varchar(32) NOT NULL,
  `stake` int NOT NULL,
  `returned` int NOT NULL,
  `roi_pct` decimal(8,4) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`race_id`,`model_version`,`strategy`),
  KEY `idx_prediction_roi_model` (`model_version`,`race_id`,`strategy`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prediction_roi`
--

LOCK TABLES `prediction_roi` WRITE;
/*!40000 ALTER TABLE `prediction_roi` DISABLE KEYS */;
INSERT INTO `prediction_roi` VALUES ('202510130110','yosou-v1','ev_place',200,530,265.0000,'2025-10-13 02:07:41','2025-10-13 02:07:41'),('202510130110','yosou-v1','place',100,160,160.0000,'2025-10-13 02:14:14','2025-10-13 02:14:14'),('202510130110','yosou-v1','single',100,0,0.0000,'2025-10-13 02:14:14','2025-10-13 02:14:14');
/*!40000 ALTER TABLE `prediction_roi` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prediction_roi_daily`
--

DROP TABLE IF EXISTS `prediction_roi_daily`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prediction_roi_daily` (
  `ymd` date NOT NULL,
  `model_version` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `strategy` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `races` int NOT NULL,
  `invest_yen` int NOT NULL,
  `return_yen` int NOT NULL,
  `roi_percent` decimal(7,2) NOT NULL,
  PRIMARY KEY (`ymd`,`model_version`,`strategy`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prediction_roi_daily`
--

LOCK TABLES `prediction_roi_daily` WRITE;
/*!40000 ALTER TABLE `prediction_roi_daily` DISABLE KEYS */;
/*!40000 ALTER TABLE `prediction_roi_daily` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `race_cnt`
--

DROP TABLE IF EXISTS `race_cnt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `race_cnt` (
  `id` varchar(10) COLLATE utf8mb4_general_ci NOT NULL,
  `cnt` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `race_cnt`
--

LOCK TABLES `race_cnt` WRITE;
/*!40000 ALTER TABLE `race_cnt` DISABLE KEYS */;
INSERT INTO `race_cnt` VALUES ('2025101210',12,'2025-10-12 14:29:04'),('2025101222',10,'2025-10-12 14:29:05'),('2025101231',12,'2025-10-12 14:29:05'),('2025101232',11,'2025-10-12 14:29:06'),('2025101310',12,'2025-10-12 13:57:21'),('2025101321',12,'2025-10-12 13:57:22'),('2025101332',11,'2025-10-12 13:57:22');
/*!40000 ALTER TABLE `race_cnt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `race_count_by_date`
--

DROP TABLE IF EXISTS `race_count_by_date`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `race_count_by_date` (
  `ymd` char(8) NOT NULL,
  `venue_code` varchar(4) NOT NULL,
  `total_races` int NOT NULL,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`ymd`,`venue_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `race_count_by_date`
--

LOCK TABLES `race_count_by_date` WRITE;
/*!40000 ALTER TABLE `race_count_by_date` DISABLE KEYS */;
/*!40000 ALTER TABLE `race_count_by_date` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `race_payouts`
--

DROP TABLE IF EXISTS `race_payouts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `race_payouts` (
  `race_id` bigint NOT NULL,
  `bet_type` enum('WIN','PLACE') NOT NULL,
  `horse_number` int NOT NULL,
  `payout` int DEFAULT NULL,
  `popularity` int DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`race_id`,`bet_type`,`horse_number`),
  KEY `idx_race_payouts_race` (`race_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `race_payouts`
--

LOCK TABLES `race_payouts` WRITE;
/*!40000 ALTER TABLE `race_payouts` DISABLE KEYS */;
INSERT INTO `race_payouts` VALUES (202510130110,'WIN',7,460,2,'2025-10-13 00:45:42','2025-10-13 00:45:42'),(202510130110,'PLACE',1,370,7,'2025-10-13 00:45:42','2025-10-13 00:45:42'),(202510130110,'PLACE',2,160,2,'2025-10-13 00:45:42','2025-10-13 00:45:42'),(202510130110,'PLACE',7,180,3,'2025-10-13 00:45:42','2025-10-13 00:45:42');
/*!40000 ALTER TABLE `race_payouts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `race_results`
--

DROP TABLE IF EXISTS `race_results`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `race_results` (
  `race_result_id` bigint NOT NULL AUTO_INCREMENT,
  `race_id` bigint NOT NULL,
  `frame_number` int NOT NULL,
  `horse_number` int NOT NULL,
  `horse_name` varchar(64) NOT NULL,
  `official_finish_position` int NOT NULL,
  `dead_heat_group` int DEFAULT NULL,
  `dead_heat_order_in_group` int DEFAULT NULL,
  `finish_time` varchar(16) DEFAULT NULL,
  `margin` varchar(16) DEFAULT NULL,
  `jockey_name` varchar(64) DEFAULT NULL,
  `odds_final` decimal(8,2) DEFAULT NULL,
  `prize` int DEFAULT NULL,
  `disqualified` tinyint(1) NOT NULL DEFAULT '0',
  `notes` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`race_result_id`),
  UNIQUE KEY `uq_race_results` (`race_id`,`horse_number`),
  KEY `idx_race_results_race` (`race_id`),
  KEY `idx_race_results_jockey` (`jockey_name`)
) ENGINE=InnoDB AUTO_INCREMENT=232 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `race_results`
--

LOCK TABLES `race_results` WRITE;
/*!40000 ALTER TABLE `race_results` DISABLE KEYS */;
INSERT INTO `race_results` VALUES (1,202510130110,6,7,'ファータフィオーレ',1,NULL,NULL,'1:00.2',NULL,'大坪慎 (盛岡)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(2,202510130110,1,1,'アイドルフェスタ',2,NULL,NULL,'1:01.0','５','菅原辰 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(3,202510130110,2,2,'スマイルバニラ',3,NULL,NULL,'1:01.1','１／２','山本聡 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(4,202510130110,6,6,'シプレーノート',4,NULL,NULL,'1:01.5','２ １／２','山本紀 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(5,202510130110,4,4,'ソノバシノギ',5,NULL,NULL,'1:01.7','１','小林凌 (盛岡)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(6,202510130110,7,8,'グローブミッション',6,NULL,NULL,'1:01.7','クビ','△坂井瑛 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(7,202510130110,8,10,'ダンストンローザ',7,NULL,NULL,'1:02.2','３','佐々志 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(8,202510130110,8,11,'ラセーヌ',8,NULL,NULL,'1:02.7','３','塚本涼 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(9,202510130110,3,3,'ノーブルアイル',9,NULL,NULL,'1:03.0','１ １／２','高松亮 (水沢)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(10,202510130110,7,9,'キタスクワート',10,NULL,NULL,'1:03.4','２ １／２','鈴木祐 (盛岡)',NULL,NULL,0,NULL,'2025-10-12 21:14:46'),(11,202510130110,5,5,'メモリーメイラード',11,NULL,NULL,'1:03.8','２ １／２','南郷家 (盛岡)',NULL,NULL,0,NULL,'2025-10-12 21:14:46');
/*!40000 ALTER TABLE `race_results` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `racing_form`
--

DROP TABLE IF EXISTS `racing_form`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `racing_form` (
  `race_id` bigint NOT NULL,
  `frame_number` int NOT NULL,
  `horse_number` int NOT NULL,
  `horse_name` varchar(64) NOT NULL,
  `sex_age` varchar(8) DEFAULT NULL,
  `hair` varchar(8) DEFAULT NULL,
  `birthyear` tinyint unsigned DEFAULT NULL,
  `birthymonth` tinyint unsigned DEFAULT NULL,
  `sire` varchar(64) DEFAULT NULL,
  `dam` varchar(64) DEFAULT NULL,
  `broodmare_sire` varchar(64) DEFAULT NULL,
  `carried_weight` decimal(4,1) DEFAULT NULL,
  `jockey_name` varchar(64) DEFAULT NULL,
  `affiliation` varchar(16) DEFAULT NULL,
  `trainer_name` varchar(64) DEFAULT NULL,
  `owner` varchar(64) DEFAULT NULL,
  `breeder` varchar(64) DEFAULT NULL,
  `odds_morning` decimal(8,2) DEFAULT NULL,
  `horse_weight` int DEFAULT NULL,
  `horse_weight_diff` int DEFAULT NULL,
  `draw_number` int DEFAULT NULL,
  `remarks` varchar(255) DEFAULT NULL,
  `raw_json` json DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`race_id`,`horse_number`),
  KEY `idx_racing_form_race` (`race_id`),
  KEY `idx_racing_form_jockey` (`jockey_name`),
  KEY `idx_racing_form_trainer` (`trainer_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `racing_form`
--

LOCK TABLES `racing_form` WRITE;
/*!40000 ALTER TABLE `racing_form` DISABLE KEYS */;
INSERT INTO `racing_form` VALUES (202510130110,1,1,'アイドルフェスタ','牝3','黒鹿毛',22,4,'アイドルフェスタ','カリフォルニアクローム','オレハマッテルゼ',54.0,'菅原辰','岩手',NULL,NULL,'三嶋牧場',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,2,2,'スマイルバニラ','牝3','黒鹿毛',22,4,'スマイルバニラ','リオンディーズ','ヴィクトワールピサ',54.0,'山本聡','岩手',NULL,NULL,'習志野牧場',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,3,3,'ノーブルアイル','牝3','黒鹿毛',22,5,'ノーブルアイル','ミッキーアイル','Blame',54.0,'高松亮','岩手',NULL,NULL,'市川フアーム',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,4,4,'ソノバシノギ','牝3','鹿毛',22,2,'ソノバシノギ','フォーウィールドライブ','ハーツクライ',54.0,'小林凌','岩手',NULL,NULL,'新井昭二牧場',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,5,5,'メモリーメイラード','牝3','栗毛',22,5,'メモリーメイラード','スマートファルコン','ヘニーヒューズ',54.0,'南郷家','岩手',NULL,NULL,'対馬正',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,6,6,'シプレーノート','牝3','鹿毛',22,4,'シプレーノート','ディーマジェスティ','サクラバクシンオー',54.0,'山本紀','岩手',NULL,NULL,'社台ファーム',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,6,7,'ファータフィオーレ','牝3','鹿毛',22,4,'ファータフィオーレ','サトノアラジン','アドマイヤムーン',54.0,'大坪慎','岩手',NULL,NULL,'フジワラフアーム',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,7,8,'グローブミッション','牝3','栗毛',22,4,'グローブミッション','ノーブルミッション','ダイワメジャー',52.0,'坂井瑛','岩手',NULL,NULL,'広田牧場',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,7,9,'キタスクワート','牡11','栗毛',14,6,'キタスクワート','スクワートルスクワート','ジェネラス',56.0,'鈴木祐','岩手',NULL,NULL,'北村牧場',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,8,10,'ダンストンローザ','牝3','鹿毛',22,6,'ダンストンローザ','ストロングリターン','ホワイトマズル',54.0,'佐々志','岩手',NULL,NULL,'レジェンドファーム',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10'),(202510130110,8,11,'ラセーヌ','牝3','栗毛',22,4,'ラセーヌ','タワーオブロンドン','キングカメハメハ',54.0,'塚本涼','岩手',NULL,NULL,'前田ファーム',NULL,NULL,NULL,NULL,NULL,NULL,'2025-10-12 21:48:10','2025-10-12 21:48:10');
/*!40000 ALTER TABLE `racing_form` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sire_ranking`
--

DROP TABLE IF EXISTS `sire_ranking`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sire_ranking` (
  `distance_m` int NOT NULL,
  `sire_id` bigint NOT NULL,
  `sire_name` varchar(255) NOT NULL,
  `score` int NOT NULL,
  PRIMARY KEY (`distance_m`,`sire_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sire_ranking`
--

LOCK TABLES `sire_ranking` WRITE;
/*!40000 ALTER TABLE `sire_ranking` DISABLE KEYS */;
INSERT INTO `sire_ranking` VALUES (800,310467,'サウスヴィグラス(USA)',63),(800,325200,'ジャングルポケット',46),(800,325977,'ショウナンカンプ',7),(800,372784,'キングズベスト(USA)',27),(800,375505,'スウェプトオーヴァーボード(USA)',55),(800,701668,'ゼンノロブロイ',12),(800,725485,'ダイワメジャー',6),(800,727032,'メイショウボーラー',64),(800,751334,'ホールウォーカー',42),(800,760877,'アドマイヤムーン',54),(800,761992,'バンブーエール',71),(800,762445,'マツリダゴッホ',19),(800,801447,'スクリーンヒーロー',43),(800,807282,'フリオーソ',70),(800,848478,'ロージズインメイ(USA)',11),(800,853225,'スズカコーズウェイ',67),(800,881793,'スマートファルコン',73),(800,888832,'エスポワールシチー',100),(800,891931,'ディープスカイ',4),(800,901749,'キンシャサノキセキ(AUS)',85),(800,985381,'ディスクリートキャット(USA)',97),(800,989072,'トランセンド',68),(800,990058,'ナムラタイタン',84),(800,991842,'リーチザクラウン',36),(800,995275,'ストロングリターン',20),(800,995651,'ジョーカプチーノ',28),(800,1025279,'シニスターミニスター(USA)',94),(800,1028940,'ヘニーヒューズ(USA)',56),(800,1043835,'タイセイレジェンド',50),(800,1052586,'エイシンフラッシュ',3),(800,1083691,'マジェスティックウォリアー(USA)',80),(800,1085636,'パイロ(USA)',86),(800,1088803,'ウインバリアシオン',38),(800,1089850,'ロードカナロア',61),(800,1090360,'オルフェーヴル',23),(800,1106251,'ジャスタウェイ',59),(800,1107477,'ホッコータルマエ',92),(800,1109433,'ポアゾンブラック',89),(800,1110454,'カレンブラックヒル',81),(800,1110458,'フェノーメノ',52),(800,1110554,'ディープブリランテ',17),(800,1111008,'ワールドエース',66),(800,1121332,'コパノリチャード',30),(800,1122040,'ラブリーデイ',51),(800,1122883,'キタサンミカヅキ',65),(800,1123166,'コパノリッキー',98),(800,1127268,'ヴィットリオドーロ(USA)',21),(800,1127395,'ダンカーク(USA)',78),(800,1128605,'アニマルキングダム(USA)',5),(800,1134576,'トゥザワールド',58),(800,1134867,'レッドファルクス',82),(800,1135217,'ニシケンモノノフ',87),(800,1137087,'シゲルカガ',44),(800,1137511,'エイシンヒカリ',47),(800,1139796,'ネロ',83),(800,1141719,'ミッキーアイル',90),(800,1142398,'イスラボニータ',10),(800,1142673,'ビッグアーサー',62),(800,1149689,'ブルドッグボス',25),(800,1152403,'シュヴァルグラン',76),(800,1153481,'オールブラッシュ',9),(800,1162685,'ダノンレジェンド(USA)',69),(800,1162862,'シャンハイボビー(USA)',2),(800,1163175,'ベストウォーリア(USA)',99),(800,1164976,'トビーズコーナー(USA)',75),(800,1167517,'ディーマジェスティ',57),(800,1170063,'リオンディーズ',39),(800,1170750,'ゴールドドリーム',72),(800,1171845,'シルバーステート',53),(800,1173702,'ファインニードル',60),(800,1175196,'ミッキーロケット',48),(800,1177896,'アジアエクスプレス(USA)',91),(800,1178418,'ノヴェリスト(IRE)',15),(800,1181460,'デクラレーションオブウォー(USA)',41),(800,1186327,'エピカリス',74),(800,1189935,'サトノアレス',29),(800,1190059,'スワーヴリチャード',31),(800,1190850,'キセキ',34),(800,1191607,'アルアイン',24),(800,1193277,'モーニン(USA)',93),(800,1193283,'アポロケンタッキー(USA)',18),(800,1193308,'ルックスザットキル(USA)',26),(800,1195380,'Kantharos(USA)',34),(800,1205475,'ルヴァンスレーヴ',77),(800,1209439,'タワーオブロンドン',79),(800,1211258,'カリフォルニアクローム(USA)',22),(800,1213491,'モズアスコット(USA)',36),(800,1215726,'クリソベリル',14),(800,1224373,'タリスマニック(GB)',96),(800,1225918,'ザファクター(USA)',49),(800,1226963,'サンダースノー(IRE)',16),(800,1240339,'Violence(USA)',13),(800,1241663,'ミスターメロディ(USA)',40),(800,1243519,'ビーチパトロール(USA)',37),(800,1244377,'アメリカンペイトリオット(USA)',95),(800,1292219,'City of Light(USA)',45),(800,1295299,'Audible(USA)',34),(800,1298815,'ニューイヤーズデイ(USA)',8),(800,1302899,'マインドユアビスケッツ(USA)',1),(800,1341999,'フォーウィールドライブ(USA)',88),(1200,310467,'サウスヴィグラス(USA)',27),(1200,321265,'ノボジャック(USA)',30),(1200,619768,'ゴールドアリュール',3),(1200,719250,'Speightstown(USA)',62),(1200,725485,'ダイワメジャー',78),(1200,761992,'バンブーエール',21),(1200,801447,'スクリーンヒーロー',25),(1200,807282,'フリオーソ',88),(1200,848478,'ロージズインメイ(USA)',61),(1200,849057,'バゴ(FR)',41),(1200,853225,'スズカコーズウェイ',42),(1200,881793,'スマートファルコン',56),(1200,888832,'エスポワールシチー',91),(1200,900065,'アポロキングダム(USA)',58),(1200,901749,'キンシャサノキセキ(AUS)',87),(1200,978108,'Ghostzapper(USA)',5),(1200,985381,'ディスクリートキャット(USA)',92),(1200,989072,'トランセンド',49),(1200,995275,'ストロングリターン',34),(1200,995651,'ジョーカプチーノ',64),(1200,1025279,'シニスターミニスター(USA)',96),(1200,1028940,'ヘニーヒューズ(USA)',100),(1200,1042049,'ルーラーシップ',24),(1200,1043835,'タイセイレジェンド',4),(1200,1044310,'パドトロワ',17),(1200,1046333,'ヴィクトワールピサ',29),(1200,1052586,'エイシンフラッシュ',1),(1200,1083691,'マジェスティックウォリアー(USA)',85),(1200,1084779,'Into Mischief(USA)',70),(1200,1085636,'パイロ(USA)',90),(1200,1088812,'リアルインパクト',45),(1200,1089850,'ロードカナロア',98),(1200,1090360,'オルフェーヴル',47),(1200,1106251,'ジャスタウェイ',53),(1200,1107477,'ホッコータルマエ',93),(1200,1110454,'カレンブラックヒル',80),(1200,1110554,'ディープブリランテ',51),(1200,1111008,'ワールドエース',8),(1200,1111834,'バトルプラン(USA)',9),(1200,1120570,'キズナ',38),(1200,1122040,'ラブリーデイ',10),(1200,1123166,'コパノリッキー',94),(1200,1124297,'エピファネイア',57),(1200,1124405,'ロゴタイプ',15),(1200,1127395,'ダンカーク(USA)',39),(1200,1128605,'アニマルキングダム(USA)',20),(1200,1128881,'マクフィ(GB)',76),(1200,1134576,'トゥザワールド',44),(1200,1134867,'レッドファルクス',66),(1200,1135217,'ニシケンモノノフ',14),(1200,1137511,'エイシンヒカリ',35),(1200,1137571,'サトノアラジン',72),(1200,1138240,'モーリス',82),(1200,1141719,'ミッキーアイル',74),(1200,1142398,'イスラボニータ',86),(1200,1142673,'ビッグアーサー',73),(1200,1149061,'グレーターロンドン',59),(1200,1151936,'ドゥラメンテ',67),(1200,1152403,'シュヴァルグラン',32),(1200,1157711,'リアルスティール',83),(1200,1162685,'ダノンレジェンド(USA)',95),(1200,1162862,'シャンハイボビー(USA)',69),(1200,1163175,'ベストウォーリア(USA)',81),(1200,1164410,'Twirling Candy(USA)',11),(1200,1164976,'トビーズコーナー(USA)',46),(1200,1167517,'ディーマジェスティ',50),(1200,1170063,'リオンディーズ',77),(1200,1170750,'ゴールドドリーム',65),(1200,1171845,'シルバーステート',36),(1200,1173702,'ファインニードル',43),(1200,1175221,'サトノダイヤモンド',37),(1200,1177896,'アジアエクスプレス(USA)',99),(1200,1181460,'デクラレーションオブウォー(USA)',71),(1200,1186327,'エピカリス',12),(1200,1191607,'アルアイン',6),(1200,1193277,'モーニン(USA)',89),(1200,1193308,'ルックスザットキル(USA)',31),(1200,1193574,'パレスマリス(USA)',26),(1200,1194505,'ラニ(USA)',54),(1200,1197426,'Frosted(USA)',22),(1200,1205475,'ルヴァンスレーヴ',55),(1200,1209439,'タワーオブロンドン',19),(1200,1211037,'Shalaa(IRE)',18),(1200,1211258,'カリフォルニアクローム(USA)',68),(1200,1213491,'モズアスコット(USA)',63),(1200,1224373,'タリスマニック(GB)',40),(1200,1225918,'ザファクター(USA)',28),(1200,1226963,'サンダースノー(IRE)',75),(1200,1238289,'American Pharoah(USA)',23),(1200,1240055,'ドレフォン(USA)',97),(1200,1241663,'ミスターメロディ(USA)',48),(1200,1244377,'アメリカンペイトリオット(USA)',60),(1200,1288621,'Gun Runner(USA)',7),(1200,1293348,'ブリックスアンドモルタル(USA)',2),(1200,1298815,'ニューイヤーズデイ(USA)',84),(1200,1302899,'マインドユアビスケッツ(USA)',33),(1200,1313451,'Justify(USA)',13),(1200,1328857,'ナダル(USA)',52),(1200,1341999,'フォーウィールドライブ(USA)',79),(1200,1383193,'Volatile(USA)',16),(1300,310467,'サウスヴィグラス(USA)',70),(1300,372825,'プリサイスエンド(USA)',27),(1300,714411,'ケイムホーム(USA)',38),(1300,722158,'ハーツクライ',54),(1300,725485,'ダイワメジャー',71),(1300,727032,'メイショウボーラー',35),(1300,729458,'キングカメハメハ',18),(1300,761992,'バンブーエール',65),(1300,762445,'マツリダゴッホ',5),(1300,801447,'スクリーンヒーロー',72),(1300,807282,'フリオーソ',82),(1300,848478,'ロージズインメイ(USA)',93),(1300,849057,'バゴ(FR)',24),(1300,853225,'スズカコーズウェイ',25),(1300,881793,'スマートファルコン',74),(1300,888832,'エスポワールシチー',96),(1300,901749,'キンシャサノキセキ(AUS)',88),(1300,985381,'ディスクリートキャット(USA)',84),(1300,989072,'トランセンド',20),(1300,991842,'リーチザクラウン',32),(1300,991898,'トーセンジョーダン',62),(1300,995275,'ストロングリターン',78),(1300,995651,'ジョーカプチーノ',33),(1300,1025279,'シニスターミニスター(USA)',86),(1300,1028940,'ヘニーヒューズ(USA)',99),(1300,1040066,'カジノドライヴ(USA)',40),(1300,1042049,'ルーラーシップ',50),(1300,1043831,'トゥザグローリー',28),(1300,1044310,'パドトロワ',31),(1300,1046333,'ヴィクトワールピサ',13),(1300,1052586,'エイシンフラッシュ',41),(1300,1083691,'マジェスティックウォリアー(USA)',98),(1300,1085636,'パイロ(USA)',94),(1300,1088812,'リアルインパクト',44),(1300,1089850,'ロードカナロア',95),(1300,1090360,'オルフェーヴル',34),(1300,1090394,'グランプリボス',30),(1300,1090769,'ダノンバラード',11),(1300,1101689,'ヴァンセンヌ',43),(1300,1104811,'ゴールドシップ',59),(1300,1106251,'ジャスタウェイ',39),(1300,1107477,'ホッコータルマエ',81),(1300,1110454,'カレンブラックヒル',87),(1300,1110554,'ディープブリランテ',48),(1300,1111008,'ワールドエース',10),(1300,1120570,'キズナ',7),(1300,1122040,'ラブリーデイ',12),(1300,1123166,'コパノリッキー',90),(1300,1124297,'エピファネイア',51),(1300,1124405,'ロゴタイプ',46),(1300,1127395,'ダンカーク(USA)',75),(1300,1128605,'アニマルキングダム(USA)',3),(1300,1128881,'マクフィ(GB)',80),(1300,1134576,'トゥザワールド',8),(1300,1134867,'レッドファルクス',61),(1300,1135217,'ニシケンモノノフ',73),(1300,1137511,'エイシンヒカリ',49),(1300,1137571,'サトノアラジン',67),(1300,1138240,'モーリス',23),(1300,1141719,'ミッキーアイル',76),(1300,1142398,'イスラボニータ',36),(1300,1142673,'ビッグアーサー',64),(1300,1148419,'ベーカバド(FR)',17),(1300,1149061,'グレーターロンドン',45),(1300,1151936,'ドゥラメンテ',85),(1300,1152403,'シュヴァルグラン',9),(1300,1157711,'リアルスティール',91),(1300,1162685,'ダノンレジェンド(USA)',97),(1300,1162862,'シャンハイボビー(USA)',57),(1300,1162905,'サトノクラウン',66),(1300,1163175,'ベストウォーリア(USA)',77),(1300,1164976,'トビーズコーナー(USA)',55),(1300,1167517,'ディーマジェスティ',16),(1300,1170063,'リオンディーズ',68),(1300,1170750,'ゴールドドリーム',52),(1300,1171845,'シルバーステート',42),(1300,1173702,'ファインニードル',58),(1300,1175221,'サトノダイヤモンド',19),(1300,1177347,'ウィルテイクチャージ(USA)',69),(1300,1177896,'アジアエクスプレス(USA)',83),(1300,1178418,'ノヴェリスト(IRE)',15),(1300,1181460,'デクラレーションオブウォー(USA)',47),(1300,1190059,'スワーヴリチャード',4),(1300,1192958,'モンテロッソ(GB)',14),(1300,1193277,'モーニン(USA)',60),(1300,1203083,'エポカドーロ',22),(1300,1208483,'ヘンリーバローズ',29),(1300,1211258,'カリフォルニアクローム(USA)',2),(1300,1213491,'モズアスコット(USA)',6),(1300,1224373,'タリスマニック(GB)',92),(1300,1226963,'サンダースノー(IRE)',79),(1300,1227898,'クリエイター２(USA)',26),(1300,1240055,'ドレフォン(USA)',100),(1300,1243519,'ビーチパトロール(USA)',56),(1300,1244377,'アメリカンペイトリオット(USA)',89),(1300,1288621,'Gun Runner(USA)',37),(1300,1293348,'ブリックスアンドモルタル(USA)',1),(1300,1302899,'マインドユアビスケッツ(USA)',53),(1300,1328857,'ナダル(USA)',21),(1300,1341999,'フォーウィールドライブ(USA)',63),(1400,310467,'サウスヴィグラス(USA)',12),(1400,369832,'Lemon Drop Kid(USA)',14),(1400,701668,'ゼンノロブロイ',13),(1400,722158,'ハーツクライ',67),(1400,722797,'ブラックタイド',46),(1400,725485,'ダイワメジャー',72),(1400,727032,'メイショウボーラー',32),(1400,729458,'キングカメハメハ',26),(1400,761992,'バンブーエール',29),(1400,801447,'スクリーンヒーロー',18),(1400,807282,'フリオーソ',66),(1400,848478,'ロージズインメイ(USA)',52),(1400,849057,'バゴ(FR)',11),(1400,853225,'スズカコーズウェイ',7),(1400,881793,'スマートファルコン',83),(1400,888832,'エスポワールシチー',90),(1400,901749,'キンシャサノキセキ(AUS)',80),(1400,985381,'ディスクリートキャット(USA)',74),(1400,989072,'トランセンド',24),(1400,995275,'ストロングリターン',64),(1400,995651,'ジョーカプチーノ',27),(1400,1025279,'シニスターミニスター(USA)',98),(1400,1028940,'ヘニーヒューズ(USA)',95),(1400,1042049,'ルーラーシップ',78),(1400,1043831,'トゥザグローリー',22),(1400,1046333,'ヴィクトワールピサ',17),(1400,1052586,'エイシンフラッシュ',30),(1400,1083691,'マジェスティックウォリアー(USA)',96),(1400,1084779,'Into Mischief(USA)',51),(1400,1085636,'パイロ(USA)',91),(1400,1088812,'リアルインパクト',50),(1400,1089850,'ロードカナロア',99),(1400,1090360,'オルフェーヴル',58),(1400,1090394,'グランプリボス',28),(1400,1090769,'ダノンバラード',44),(1400,1101689,'ヴァンセンヌ',6),(1400,1104811,'ゴールドシップ',10),(1400,1106251,'ジャスタウェイ',71),(1400,1107477,'ホッコータルマエ',94),(1400,1110454,'カレンブラックヒル',75),(1400,1110554,'ディープブリランテ',8),(1400,1111008,'ワールドエース',42),(1400,1111834,'バトルプラン(USA)',2),(1400,1115148,'ハービンジャー(GB)',25),(1400,1120570,'キズナ',82),(1400,1122040,'ラブリーデイ',34),(1400,1123166,'コパノリッキー',93),(1400,1124297,'エピファネイア',56),(1400,1124405,'ロゴタイプ',21),(1400,1126608,'インカンテーション',9),(1400,1127395,'ダンカーク(USA)',62),(1400,1128605,'アニマルキングダム(USA)',23),(1400,1128881,'マクフィ(GB)',73),(1400,1134576,'トゥザワールド',37),(1400,1134867,'レッドファルクス',49),(1400,1137511,'エイシンヒカリ',47),(1400,1137571,'サトノアラジン',60),(1400,1138240,'モーリス',86),(1400,1141719,'ミッキーアイル',87),(1400,1142398,'イスラボニータ',61),(1400,1142673,'ビッグアーサー',36),(1400,1149061,'グレーターロンドン',4),(1400,1151936,'ドゥラメンテ',81),(1400,1152403,'シュヴァルグラン',35),(1400,1155349,'キタサンブラック',31),(1400,1157711,'リアルスティール',89),(1400,1162685,'ダノンレジェンド(USA)',97),(1400,1162862,'シャンハイボビー(USA)',65),(1400,1162905,'サトノクラウン',33),(1400,1163175,'ベストウォーリア(USA)',79),(1400,1164976,'トビーズコーナー(USA)',15),(1400,1167517,'ディーマジェスティ',39),(1400,1170063,'リオンディーズ',77),(1400,1170750,'ゴールドドリーム',63),(1400,1171845,'シルバーステート',38),(1400,1173702,'ファインニードル',48),(1400,1175221,'サトノダイヤモンド',20),(1400,1177896,'アジアエクスプレス(USA)',92),(1400,1181460,'デクラレーションオブウォー(USA)',68),(1400,1191607,'アルアイン',3),(1400,1192958,'モンテロッソ(GB)',16),(1400,1193277,'モーニン(USA)',85),(1400,1193283,'アポロケンタッキー(USA)',5),(1400,1194505,'ラニ(USA)',55),(1400,1205475,'ルヴァンスレーヴ',57),(1400,1211258,'カリフォルニアクローム(USA)',43),(1400,1213491,'モズアスコット(USA)',59),(1400,1224373,'タリスマニック(GB)',45),(1400,1225918,'ザファクター(USA)',19),(1400,1226963,'サンダースノー(IRE)',76),(1400,1238289,'American Pharoah(USA)',53),(1400,1240055,'ドレフォン(USA)',100),(1400,1243519,'ビーチパトロール(USA)',69),(1400,1244377,'アメリカンペイトリオット(USA)',70),(1400,1293348,'ブリックスアンドモルタル(USA)',41),(1400,1298815,'ニューイヤーズデイ(USA)',88),(1400,1302899,'マインドユアビスケッツ(USA)',84),(1400,1313451,'Justify(USA)',1),(1400,1328857,'ナダル(USA)',40),(1400,1341999,'フォーウィールドライブ(USA)',54),(1500,372825,'プリサイスエンド(USA)',5),(1500,701577,'ネオユニヴァース',15),(1500,722158,'ハーツクライ',10),(1500,722797,'ブラックタイド',20),(1500,725485,'ダイワメジャー',38),(1500,727032,'メイショウボーラー',49),(1500,760877,'アドマイヤムーン',1),(1500,761992,'バンブーエール',37),(1500,801447,'スクリーンヒーロー',44),(1500,807282,'フリオーソ',86),(1500,848478,'ロージズインメイ(USA)',21),(1500,849057,'バゴ(FR)',36),(1500,881793,'スマートファルコン',74),(1500,888832,'エスポワールシチー',97),(1500,901749,'キンシャサノキセキ(AUS)',73),(1500,985381,'ディスクリートキャット(USA)',91),(1500,989072,'トランセンド',33),(1500,991898,'トーセンジョーダン',11),(1500,995275,'ストロングリターン',51),(1500,995651,'ジョーカプチーノ',42),(1500,1025279,'シニスターミニスター(USA)',84),(1500,1028940,'ヘニーヒューズ(USA)',92),(1500,1042049,'ルーラーシップ',83),(1500,1043831,'トゥザグローリー',24),(1500,1046333,'ヴィクトワールピサ',23),(1500,1052586,'エイシンフラッシュ',40),(1500,1083691,'マジェスティックウォリアー(USA)',99),(1500,1085636,'パイロ(USA)',93),(1500,1088812,'リアルインパクト',19),(1500,1089850,'ロードカナロア',95),(1500,1089854,'ベルシャザール',50),(1500,1090360,'オルフェーヴル',78),(1500,1090769,'ダノンバラード',45),(1500,1096885,'トーセンラー',29),(1500,1104811,'ゴールドシップ',53),(1500,1106251,'ジャスタウェイ',76),(1500,1107477,'ホッコータルマエ',100),(1500,1108175,'ハクサンムーン',25),(1500,1110454,'カレンブラックヒル',80),(1500,1110554,'ディープブリランテ',12),(1500,1111008,'ワールドエース',63),(1500,1111834,'バトルプラン(USA)',58),(1500,1115148,'ハービンジャー(GB)',27),(1500,1120570,'キズナ',87),(1500,1122040,'ラブリーデイ',41),(1500,1123166,'コパノリッキー',94),(1500,1124297,'エピファネイア',62),(1500,1124405,'ロゴタイプ',55),(1500,1127395,'ダンカーク(USA)',71),(1500,1128881,'マクフィ(GB)',57),(1500,1129173,'エスケンデレヤ(USA)',68),(1500,1134576,'トゥザワールド',60),(1500,1134867,'レッドファルクス',72),(1500,1136428,'ゴールドアクター',28),(1500,1137511,'エイシンヒカリ',47),(1500,1137571,'サトノアラジン',22),(1500,1138240,'モーリス',61),(1500,1141719,'ミッキーアイル',6),(1500,1142398,'イスラボニータ',66),(1500,1142673,'ビッグアーサー',54),(1500,1149061,'グレーターロンドン',7),(1500,1151314,'レーヴミストラル',9),(1500,1151936,'ドゥラメンテ',59),(1500,1152403,'シュヴァルグラン',56),(1500,1155349,'キタサンブラック',34),(1500,1157711,'リアルスティール',85),(1500,1162685,'ダノンレジェンド(USA)',98),(1500,1162862,'シャンハイボビー(USA)',18),(1500,1162905,'サトノクラウン',65),(1500,1163175,'ベストウォーリア(USA)',52),(1500,1163245,'アイルハヴアナザー(USA)',3),(1500,1164976,'トビーズコーナー(USA)',43),(1500,1167517,'ディーマジェスティ',32),(1500,1169928,'レインボーライン',16),(1500,1170063,'リオンディーズ',88),(1500,1171845,'シルバーステート',64),(1500,1173702,'ファインニードル',35),(1500,1175196,'ミッキーロケット',2),(1500,1177896,'アジアエクスプレス(USA)',90),(1500,1181460,'デクラレーションオブウォー(USA)',39),(1500,1189721,'レイデオロ',17),(1500,1191607,'アルアイン',26),(1500,1192958,'モンテロッソ(GB)',31),(1500,1193277,'モーニン(USA)',79),(1500,1193283,'アポロケンタッキー(USA)',13),(1500,1194505,'ラニ(USA)',81),(1500,1205475,'ルヴァンスレーヴ',46),(1500,1211258,'カリフォルニアクローム(USA)',67),(1500,1213491,'モズアスコット(USA)',14),(1500,1224373,'タリスマニック(GB)',70),(1500,1225918,'ザファクター(USA)',4),(1500,1226963,'サンダースノー(IRE)',48),(1500,1227898,'クリエイター２(USA)',8),(1500,1240055,'ドレフォン(USA)',96),(1500,1243519,'ビーチパトロール(USA)',69),(1500,1244377,'アメリカンペイトリオット(USA)',75),(1500,1293348,'ブリックスアンドモルタル(USA)',77),(1500,1298815,'ニューイヤーズデイ(USA)',89),(1500,1302899,'マインドユアビスケッツ(USA)',82),(1500,1328857,'ナダル(USA)',30),(1600,294840,'キングヘイロー',11),(1600,325098,'タイムパラドックス',28),(1600,369832,'Lemon Drop Kid(USA)',69),(1600,619768,'ゴールドアリュール',22),(1600,722158,'ハーツクライ',57),(1600,722797,'ブラックタイド',66),(1600,725485,'ダイワメジャー',51),(1600,727032,'メイショウボーラー',25),(1600,729458,'キングカメハメハ',91),(1600,761992,'バンブーエール',27),(1600,801447,'スクリーンヒーロー',71),(1600,807282,'フリオーソ',78),(1600,848478,'ロージズインメイ(USA)',73),(1600,881793,'スマートファルコン',95),(1600,888832,'エスポワールシチー',89),(1600,901749,'キンシャサノキセキ(AUS)',80),(1600,985381,'ディスクリートキャット(USA)',77),(1600,989072,'トランセンド',45),(1600,991842,'リーチザクラウン',52),(1600,995275,'ストロングリターン',70),(1600,995651,'ジョーカプチーノ',18),(1600,1025279,'シニスターミニスター(USA)',97),(1600,1028940,'ヘニーヒューズ(USA)',100),(1600,1042049,'ルーラーシップ',74),(1600,1043831,'トゥザグローリー',5),(1600,1046333,'ヴィクトワールピサ',10),(1600,1083691,'マジェスティックウォリアー(USA)',86),(1600,1084779,'Into Mischief(USA)',63),(1600,1085636,'パイロ(USA)',93),(1600,1088812,'リアルインパクト',43),(1600,1089850,'ロードカナロア',99),(1600,1089854,'ベルシャザール',35),(1600,1090360,'オルフェーヴル',62),(1600,1090769,'ダノンバラード',31),(1600,1104811,'ゴールドシップ',15),(1600,1106251,'ジャスタウェイ',82),(1600,1107477,'ホッコータルマエ',94),(1600,1110454,'カレンブラックヒル',75),(1600,1111008,'ワールドエース',21),(1600,1111834,'バトルプラン(USA)',2),(1600,1115148,'ハービンジャー(GB)',12),(1600,1120570,'キズナ',96),(1600,1122040,'ラブリーデイ',72),(1600,1123166,'コパノリッキー',83),(1600,1124297,'エピファネイア',30),(1600,1124405,'ロゴタイプ',54),(1600,1126608,'インカンテーション',67),(1600,1127395,'ダンカーク(USA)',23),(1600,1128605,'アニマルキングダム(USA)',16),(1600,1128881,'マクフィ(GB)',49),(1600,1129173,'エスケンデレヤ(USA)',50),(1600,1134576,'トゥザワールド',14),(1600,1134867,'レッドファルクス',32),(1600,1135217,'ニシケンモノノフ',24),(1600,1137511,'エイシンヒカリ',7),(1600,1137571,'サトノアラジン',19),(1600,1138240,'モーリス',56),(1600,1141719,'ミッキーアイル',39),(1600,1142398,'イスラボニータ',48),(1600,1151936,'ドゥラメンテ',92),(1600,1155349,'キタサンブラック',88),(1600,1157711,'リアルスティール',84),(1600,1162685,'ダノンレジェンド(USA)',79),(1600,1162704,'アポロソニック(USA)',1),(1600,1162862,'シャンハイボビー(USA)',38),(1600,1162905,'サトノクラウン',41),(1600,1163175,'ベストウォーリア(USA)',34),(1600,1163245,'アイルハヴアナザー(USA)',53),(1600,1164976,'トビーズコーナー(USA)',47),(1600,1167517,'ディーマジェスティ',55),(1600,1170063,'リオンディーズ',61),(1600,1170750,'ゴールドドリーム',20),(1600,1171845,'シルバーステート',29),(1600,1173702,'ファインニードル',13),(1600,1175221,'サトノダイヤモンド',9),(1600,1177896,'アジアエクスプレス(USA)',90),(1600,1178418,'ノヴェリスト(IRE)',6),(1600,1181460,'デクラレーションオブウォー(USA)',81),(1600,1189721,'レイデオロ',17),(1600,1192958,'モンテロッソ(GB)',59),(1600,1193277,'モーニン(USA)',60),(1600,1194505,'ラニ(USA)',44),(1600,1205475,'ルヴァンスレーヴ',64),(1600,1211258,'カリフォルニアクローム(USA)',65),(1600,1221464,'ロジャーバローズ',3),(1600,1224373,'タリスマニック(GB)',36),(1600,1226463,'Maclean\'s Music(USA)',42),(1600,1226963,'サンダースノー(IRE)',76),(1600,1227898,'クリエイター２(USA)',4),(1600,1238289,'American Pharoah(USA)',40),(1600,1240055,'ドレフォン(USA)',98),(1600,1243519,'ビーチパトロール(USA)',8),(1600,1244377,'アメリカンペイトリオット(USA)',33),(1600,1244581,'Arrogate(USA)',37),(1600,1250287,'Mendelssohn(USA)',58),(1600,1293348,'ブリックスアンドモルタル(USA)',26),(1600,1298815,'ニューイヤーズデイ(USA)',87),(1600,1302899,'マインドユアビスケッツ(USA)',85),(1600,1313451,'Justify(USA)',46),(1600,1328857,'ナダル(USA)',68),(1800,369832,'Lemon Drop Kid(USA)',59),(1800,372825,'プリサイスエンド(USA)',12),(1800,722158,'ハーツクライ',84),(1800,725485,'ダイワメジャー',52),(1800,727032,'メイショウボーラー',39),(1800,729458,'キングカメハメハ',56),(1800,761992,'バンブーエール',23),(1800,801447,'スクリーンヒーロー',34),(1800,807282,'フリオーソ',48),(1800,848478,'ロージズインメイ(USA)',29),(1800,849057,'バゴ(FR)',18),(1800,853225,'スズカコーズウェイ',65),(1800,888832,'エスポワールシチー',37),(1800,901749,'キンシャサノキセキ(AUS)',55),(1800,905163,'タートルボウル(IRE)',17),(1800,985381,'ディスクリートキャット(USA)',22),(1800,989072,'トランセンド',8),(1800,991842,'リーチザクラウン',32),(1800,991898,'トーセンジョーダン',3),(1800,995275,'ストロングリターン',20),(1800,1025279,'シニスターミニスター(USA)',99),(1800,1028940,'ヘニーヒューズ(USA)',96),(1800,1042049,'ルーラーシップ',79),(1800,1083691,'マジェスティックウォリアー(USA)',94),(1800,1085636,'パイロ(USA)',92),(1800,1088812,'リアルインパクト',83),(1800,1089850,'ロードカナロア',77),(1800,1090360,'オルフェーヴル',70),(1800,1090769,'ダノンバラード',21),(1800,1104811,'ゴールドシップ',67),(1800,1106251,'ジャスタウェイ',85),(1800,1107477,'ホッコータルマエ',97),(1800,1110454,'カレンブラックヒル',54),(1800,1110458,'フェノーメノ',6),(1800,1111008,'ワールドエース',46),(1800,1115148,'ハービンジャー(GB)',61),(1800,1120570,'キズナ',100),(1800,1122040,'ラブリーデイ',33),(1800,1123166,'コパノリッキー',74),(1800,1124297,'エピファネイア',64),(1800,1124405,'ロゴタイプ',66),(1800,1126608,'インカンテーション',2),(1800,1127395,'ダンカーク(USA)',47),(1800,1128605,'アニマルキングダム(USA)',26),(1800,1128881,'マクフィ(GB)',75),(1800,1129173,'エスケンデレヤ(USA)',44),(1800,1134867,'レッドファルクス',50),(1800,1137571,'サトノアラジン',63),(1800,1138240,'モーリス',60),(1800,1141719,'ミッキーアイル',82),(1800,1142398,'イスラボニータ',71),(1800,1142460,'バンドワゴン',11),(1800,1144053,'ケープブランコ(IRE)',13),(1800,1151936,'ドゥラメンテ',95),(1800,1152403,'シュヴァルグラン',42),(1800,1155349,'キタサンブラック',81),(1800,1157711,'リアルスティール',90),(1800,1162685,'ダノンレジェンド(USA)',80),(1800,1162862,'シャンハイボビー(USA)',38),(1800,1162905,'サトノクラウン',27),(1800,1163175,'ベストウォーリア(USA)',25),(1800,1163245,'アイルハヴアナザー(USA)',24),(1800,1164976,'トビーズコーナー(USA)',16),(1800,1167517,'ディーマジェスティ',36),(1800,1170063,'リオンディーズ',87),(1800,1170750,'ゴールドドリーム',58),(1800,1171105,'ミッキーグローリー',1),(1800,1171845,'シルバーステート',41),(1800,1175221,'サトノダイヤモンド',78),(1800,1177896,'アジアエクスプレス(USA)',89),(1800,1178407,'レガーロ',31),(1800,1181460,'デクラレーションオブウォー(USA)',73),(1800,1186327,'エピカリス',19),(1800,1189721,'レイデオロ',72),(1800,1190059,'スワーヴリチャード',4),(1800,1193277,'モーニン(USA)',57),(1800,1194505,'ラニ(USA)',40),(1800,1205475,'ルヴァンスレーヴ',93),(1800,1211258,'カリフォルニアクローム(USA)',68),(1800,1213491,'モズアスコット(USA)',49),(1800,1215724,'サートゥルナーリア',14),(1800,1215726,'クリソベリル',15),(1800,1221464,'ロジャーバローズ',5),(1800,1221956,'アドマイヤマーズ',7),(1800,1224373,'タリスマニック(GB)',51),(1800,1226963,'サンダースノー(IRE)',91),(1800,1227898,'クリエイター２(USA)',9),(1800,1238289,'American Pharoah(USA)',53),(1800,1240055,'ドレフォン(USA)',98),(1800,1243519,'ビーチパトロール(USA)',35),(1800,1244377,'アメリカンペイトリオット(USA)',62),(1800,1244581,'Arrogate(USA)',28),(1800,1287720,'Khozan(USA)',30),(1800,1288621,'Gun Runner(USA)',43),(1800,1293152,'Practical Joke(USA)',10),(1800,1293348,'ブリックスアンドモルタル(USA)',69),(1800,1298815,'ニューイヤーズデイ(USA)',86),(1800,1302899,'マインドユアビスケッツ(USA)',76),(1800,1313451,'Justify(USA)',45),(1800,1328857,'ナダル(USA)',88),(2000,325200,'ジャングルポケット',52),(2000,615577,'クロフネ(USA)',3),(2000,619768,'ゴールドアリュール',16),(2000,722158,'ハーツクライ',91),(2000,722261,'トーセンブライト',35),(2000,725485,'ダイワメジャー',9),(2000,729458,'キングカメハメハ',87),(2000,742976,'ディープインパクト',57),(2000,761992,'バンブーエール',44),(2000,801447,'スクリーンヒーロー',37),(2000,807282,'フリオーソ',78),(2000,848478,'ロージズインメイ(USA)',80),(2000,849057,'バゴ(FR)',20),(2000,881793,'スマートファルコン',21),(2000,888832,'エスポワールシチー',43),(2000,888992,'シルポート',8),(2000,901749,'キンシャサノキセキ(AUS)',59),(2000,989072,'トランセンド',83),(2000,990058,'ナムラタイタン',10),(2000,991842,'リーチザクラウン',88),(2000,991898,'トーセンジョーダン',49),(2000,995275,'ストロングリターン',41),(2000,1025279,'シニスターミニスター(USA)',98),(2000,1028940,'ヘニーヒューズ(USA)',76),(2000,1037129,'Daaher(CAN)',57),(2000,1040066,'カジノドライヴ(USA)',6),(2000,1042049,'ルーラーシップ',82),(2000,1049689,'ニホンピロアワーズ',26),(2000,1051353,'Curlin(USA)',36),(2000,1083691,'マジェスティックウォリアー(USA)',99),(2000,1085636,'パイロ(USA)',92),(2000,1088812,'リアルインパクト',31),(2000,1089850,'ロードカナロア',60),(2000,1089854,'ベルシャザール',62),(2000,1090360,'オルフェーヴル',70),(2000,1090769,'ダノンバラード',25),(2000,1104811,'ゴールドシップ',66),(2000,1106251,'ジャスタウェイ',74),(2000,1107477,'ホッコータルマエ',94),(2000,1110454,'カレンブラックヒル',72),(2000,1111008,'ワールドエース',73),(2000,1111834,'バトルプラン(USA)',23),(2000,1115148,'ハービンジャー(GB)',38),(2000,1120570,'キズナ',100),(2000,1122040,'ラブリーデイ',47),(2000,1123166,'コパノリッキー',90),(2000,1124297,'エピファネイア',71),(2000,1126608,'インカンテーション',1),(2000,1128881,'マクフィ(GB)',40),(2000,1129173,'エスケンデレヤ(USA)',63),(2000,1129435,'エーシンスピーダー(USA)',22),(2000,1134576,'トゥザワールド',2),(2000,1134867,'レッドファルクス',24),(2000,1136428,'ゴールドアクター',19),(2000,1137511,'エイシンヒカリ',7),(2000,1137571,'サトノアラジン',61),(2000,1138240,'モーリス',54),(2000,1139796,'ネロ',11),(2000,1141719,'ミッキーアイル',34),(2000,1142398,'イスラボニータ',53),(2000,1142460,'バンドワゴン',46),(2000,1149061,'グレーターロンドン',13),(2000,1151936,'ドゥラメンテ',81),(2000,1152403,'シュヴァルグラン',32),(2000,1154998,'ヤマカツエース',15),(2000,1155349,'キタサンブラック',97),(2000,1157711,'リアルスティール',95),(2000,1162685,'ダノンレジェンド(USA)',85),(2000,1162862,'シャンハイボビー(USA)',14),(2000,1162905,'サトノクラウン',48),(2000,1163175,'ベストウォーリア(USA)',5),(2000,1163245,'アイルハヴアナザー(USA)',69),(2000,1164976,'トビーズコーナー(USA)',65),(2000,1167517,'ディーマジェスティ',42),(2000,1170063,'リオンディーズ',39),(2000,1171845,'シルバーステート',28),(2000,1175168,'ヴァンキッシュラン',12),(2000,1175196,'ミッキーロケット',4),(2000,1175221,'サトノダイヤモンド',33),(2000,1177896,'アジアエクスプレス(USA)',79),(2000,1178407,'レガーロ',89),(2000,1192958,'モンテロッソ(GB)',50),(2000,1193277,'モーニン(USA)',30),(2000,1193283,'アポロケンタッキー(USA)',27),(2000,1193371,'ゴールデンバローズ(USA)',58),(2000,1194505,'ラニ(USA)',68),(2000,1205475,'ルヴァンスレーヴ',64),(2000,1224373,'タリスマニック(GB)',29),(2000,1226963,'サンダースノー(IRE)',93),(2000,1227898,'クリエイター２(USA)',18),(2000,1238289,'American Pharoah(USA)',45),(2000,1240055,'ドレフォン(USA)',96),(2000,1243519,'ビーチパトロール(USA)',67),(2000,1244377,'アメリカンペイトリオット(USA)',51),(2000,1288621,'Gun Runner(USA)',17),(2000,1293348,'ブリックスアンドモルタル(USA)',75),(2000,1298815,'ニューイヤーズデイ(USA)',84),(2000,1302899,'マインドユアビスケッツ(USA)',55),(2000,1313451,'Justify(USA)',86),(2000,1328857,'ナダル(USA)',77),(2100,325200,'ジャングルポケット',65),(2100,372825,'プリサイスエンド(USA)',11),(2100,722158,'ハーツクライ',93),(2100,722797,'ブラックタイド',11),(2100,729458,'キングカメハメハ',100),(2100,742976,'ディープインパクト',58),(2100,761992,'バンブーエール',16),(2100,801447,'スクリーンヒーロー',65),(2100,805347,'ローレルゲレイロ',22),(2100,807282,'フリオーソ',47),(2100,848478,'ロージズインメイ(USA)',54),(2100,849372,'Tapit(USA)',8),(2100,888832,'エスポワールシチー',61),(2100,888992,'シルポート',55),(2100,891931,'ディープスカイ',4),(2100,900065,'アポロキングダム(USA)',68),(2100,989072,'トランセンド',17),(2100,991842,'リーチザクラウン',40),(2100,991898,'トーセンジョーダン',44),(2100,995275,'ストロングリターン',50),(2100,995651,'ジョーカプチーノ',62),(2100,1025279,'シニスターミニスター(USA)',92),(2100,1028940,'ヘニーヒューズ(USA)',51),(2100,1037129,'Daaher(CAN)',38),(2100,1040066,'カジノドライヴ(USA)',30),(2100,1042049,'ルーラーシップ',67),(2100,1046333,'ヴィクトワールピサ',23),(2100,1083691,'マジェスティックウォリアー(USA)',99),(2100,1085636,'パイロ(USA)',96),(2100,1088803,'ウインバリアシオン',15),(2100,1088812,'リアルインパクト',2),(2100,1089850,'ロードカナロア',85),(2100,1090360,'オルフェーヴル',88),(2100,1094329,'アイファーソング',53),(2100,1106251,'ジャスタウェイ',74),(2100,1107477,'ホッコータルマエ',98),(2100,1110458,'フェノーメノ',42),(2100,1111008,'ワールドエース',69),(2100,1115148,'ハービンジャー(GB)',63),(2100,1120570,'キズナ',95),(2100,1122040,'ラブリーデイ',41),(2100,1123166,'コパノリッキー',79),(2100,1124297,'エピファネイア',81),(2100,1124405,'ロゴタイプ',43),(2100,1126608,'インカンテーション',50),(2100,1129173,'エスケンデレヤ(USA)',14),(2100,1134576,'トゥザワールド',38),(2100,1134867,'レッドファルクス',30),(2100,1136428,'ゴールドアクター',14),(2100,1137511,'エイシンヒカリ',20),(2100,1137571,'サトノアラジン',7),(2100,1138240,'モーリス',60),(2100,1138783,'ワンアンドオンリー',24),(2100,1142398,'イスラボニータ',7),(2100,1142460,'バンドワゴン',1),(2100,1151936,'ドゥラメンテ',83),(2100,1152403,'シュヴァルグラン',52),(2100,1155349,'キタサンブラック',70),(2100,1157711,'リアルスティール',94),(2100,1162685,'ダノンレジェンド(USA)',7),(2100,1162704,'アポロソニック(USA)',31),(2100,1162862,'シャンハイボビー(USA)',12),(2100,1162905,'サトノクラウン',72),(2100,1163175,'ベストウォーリア(USA)',57),(2100,1163245,'アイルハヴアナザー(USA)',73),(2100,1164976,'トビーズコーナー(USA)',20),(2100,1167517,'ディーマジェスティ',25),(2100,1169928,'レインボーライン',36),(2100,1170063,'リオンディーズ',87),(2100,1170750,'ゴールドドリーム',9),(2100,1171105,'ミッキーグローリー',66),(2100,1171845,'シルバーステート',21),(2100,1175221,'サトノダイヤモンド',71),(2100,1177848,'マスクゾロ(USA)',30),(2100,1177896,'アジアエクスプレス(USA)',75),(2100,1181460,'デクラレーションオブウォー(USA)',59),(2100,1186327,'エピカリス',80),(2100,1189721,'レイデオロ',34),(2100,1193277,'モーニン(USA)',56),(2100,1194505,'ラニ(USA)',84),(2100,1204307,'フィエールマン',18),(2100,1205475,'ルヴァンスレーヴ',76),(2100,1213545,'Mor Spirit(USA)',33),(2100,1224373,'タリスマニック(GB)',39),(2100,1226963,'サンダースノー(IRE)',90),(2100,1227898,'クリエイター２(USA)',27),(2100,1238289,'American Pharoah(USA)',46),(2100,1240055,'ドレフォン(USA)',97),(2100,1243519,'ビーチパトロール(USA)',48),(2100,1244377,'アメリカンペイトリオット(USA)',45),(2100,1244581,'Arrogate(USA)',35),(2100,1287720,'Khozan(USA)',77),(2100,1288621,'Gun Runner(USA)',33),(2100,1293348,'ブリックスアンドモルタル(USA)',82),(2100,1295610,'Good Magic(USA)',3),(2100,1298815,'ニューイヤーズデイ(USA)',78),(2100,1302899,'マインドユアビスケッツ(USA)',91),(2100,1313451,'Justify(USA)',89),(2100,1317293,'Omaha Beach(USA)',26),(2100,1328857,'ナダル(USA)',86),(2200,237704,'ホワイトマズル(GB)',39),(2200,310467,'サウスヴィグラス(USA)',39),(2200,313435,'アッミラーレ',39),(2200,321265,'ノボジャック(USA)',39),(2200,325200,'ジャングルポケット',45),(2200,615577,'クロフネ(USA)',39),(2200,619768,'ゴールドアリュール',39),(2200,701577,'ネオユニヴァース',39),(2200,722158,'ハーツクライ',39),(2200,722261,'トーセンブライト',72),(2200,722797,'ブラックタイド',39),(2200,725485,'ダイワメジャー',88),(2200,727032,'メイショウボーラー',89),(2200,729458,'キングカメハメハ',96),(2200,742946,'カネヒキリ',39),(2200,760877,'アドマイヤムーン',39),(2200,801447,'スクリーンヒーロー',39),(2200,807282,'フリオーソ',95),(2200,848478,'ロージズインメイ(USA)',68),(2200,849057,'バゴ(FR)',39),(2200,881793,'スマートファルコン',61),(2200,888832,'エスポワールシチー',86),(2200,891710,'シビルウォー',45),(2200,891752,'セレン',80),(2200,901749,'キンシャサノキセキ(AUS)',39),(2200,985381,'ディスクリートキャット(USA)',50),(2200,989072,'トランセンド',84),(2200,991842,'リーチザクラウン',65),(2200,993502,'アンライバルド',39),(2200,995275,'ストロングリターン',39),(2200,1028940,'ヘニーヒューズ(USA)',39),(2200,1040066,'カジノドライヴ(USA)',39),(2200,1042049,'ルーラーシップ',91),(2200,1043831,'トゥザグローリー',39),(2200,1043835,'タイセイレジェンド',77),(2200,1043988,'ガルボ',39),(2200,1051353,'Curlin(USA)',49),(2200,1085636,'パイロ(USA)',83),(2200,1088803,'ウインバリアシオン',39),(2200,1089854,'ベルシャザール',93),(2200,1090360,'オルフェーヴル',79),(2200,1094278,'オーシャンブルー',41),(2200,1101689,'ヴァンセンヌ',72),(2200,1106251,'ジャスタウェイ',75),(2200,1107477,'ホッコータルマエ',63),(2200,1109418,'プレティオラス',85),(2200,1110454,'カレンブラックヒル',39),(2200,1110810,'グランデッツァ',63),(2200,1111008,'ワールドエース',74),(2200,1111834,'バトルプラン(USA)',39),(2200,1115148,'ハービンジャー(GB)',83),(2200,1120570,'キズナ',100),(2200,1122040,'ラブリーデイ',39),(2200,1123166,'コパノリッキー',98),(2200,1124297,'エピファネイア',42),(2200,1124405,'ロゴタイプ',39),(2200,1126608,'インカンテーション',90),(2200,1127395,'ダンカーク(USA)',61),(2200,1128792,'ヘニーハウンド(USA)',39),(2200,1128881,'マクフィ(GB)',78),(2200,1129173,'エスケンデレヤ(USA)',39),(2200,1134576,'トゥザワールド',61),(2200,1136428,'ゴールドアクター',39),(2200,1139796,'ネロ',39),(2200,1141719,'ミッキーアイル',39),(2200,1142398,'イスラボニータ',39),(2200,1142673,'ビッグアーサー',54),(2200,1144053,'ケープブランコ(IRE)',54),(2200,1146082,'Dark Angel(IRE)',99),(2200,1151314,'レーヴミストラル',65),(2200,1155349,'キタサンブラック',97),(2200,1157711,'リアルスティール',76),(2200,1162862,'シャンハイボビー(USA)',43),(2200,1162905,'サトノクラウン',72),(2200,1163175,'ベストウォーリア(USA)',55),(2200,1163245,'アイルハヴアナザー(USA)',94),(2200,1170063,'リオンディーズ',66),(2200,1171845,'シルバーステート',72),(2200,1173652,'サウンドスカイ',61),(2200,1175196,'ミッキーロケット',67),(2200,1177896,'アジアエクスプレス(USA)',49),(2200,1178407,'レガーロ',54),(2200,1178418,'ノヴェリスト(IRE)',61),(2200,1181460,'デクラレーションオブウォー(USA)',49),(2200,1191607,'アルアイン',92),(2200,1192958,'モンテロッソ(GB)',87),(2200,1193277,'モーニン(USA)',39),(2200,1193283,'アポロケンタッキー(USA)',39),(2200,1197660,'Upstart(USA)',61),(2200,1224373,'タリスマニック(GB)',73),(2200,1227898,'クリエイター２(USA)',39),(2200,1228789,'Camelot(GB)',39),(2200,1240333,'Emcee(USA)',39),(2200,1243519,'ビーチパトロール(USA)',49),(2200,1293348,'ブリックスアンドモルタル(USA)',40),(2200,1302899,'マインドユアビスケッツ(USA)',81),(2200,1313978,'マクマホン(ITY)',54);
/*!40000 ALTER TABLE `sire_ranking` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `venue_master`
--

DROP TABLE IF EXISTS `venue_master`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `venue_master` (
  `baba_code` int NOT NULL,
  `rakuten_baba_code` varchar(16) COLLATE utf8mb4_general_ci NOT NULL,
  `venue` varchar(32) COLLATE utf8mb4_general_ci NOT NULL,
  PRIMARY KEY (`baba_code`),
  UNIQUE KEY `uk_rakuten_baba_code` (`rakuten_baba_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `venue_master`
--

LOCK TABLES `venue_master` WRITE;
/*!40000 ALTER TABLE `venue_master` DISABLE KEYS */;
INSERT INTO `venue_master` VALUES (3,'03041503','帯広ば'),(10,'10061006','盛岡'),(11,'11060605','水沢'),(18,'18131203','浦和'),(19,'19140801','船橋'),(20,'20151205','大井'),(21,'21350805','川崎'),(22,'22181501','金沢'),(23,'23201204','笠松'),(24,'24332203','名古屋'),(27,'27261706','園田'),(28,'28260102','姫路'),(31,'31291106','高知'),(32,'32302205','佐賀'),(36,'36011504','門別');
/*!40000 ALTER TABLE `venue_master` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-13 11:16:14