CREATE DATABASE  IF NOT EXISTS `localkeiba` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_bin */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `localkeiba`;
-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: localkeiba
-- ------------------------------------------------------
-- Server version	9.4.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `calendar`
--

DROP TABLE IF EXISTS `calendar`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `calendar` (
  `race_date` date NOT NULL,
  `venucode` int NOT NULL,
  `venue` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`race_date`,`venucode`),
  UNIQUE KEY `race_date` (`race_date`,`venucode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `calendar`
--

LOCK TABLES `calendar` WRITE;
/*!40000 ALTER TABLE `calendar` DISABLE KEYS */;
INSERT INTO `calendar` VALUES ('2025-09-01',10,'盛岡'),('2025-09-01',20,'大井'),('2025-09-01',22,'金沢'),('2025-09-02',10,'盛岡'),('2025-09-02',20,'大井'),('2025-09-02',22,'金沢'),('2025-09-02',24,'名古屋'),('2025-09-02',36,'門別'),('2025-09-03',20,'大井'),('2025-09-03',24,'名古屋'),('2025-09-03',27,'園田'),('2025-09-03',36,'門別'),('2025-09-04',20,'大井'),('2025-09-04',24,'名古屋'),('2025-09-04',27,'園田'),('2025-09-04',32,'佐賀'),('2025-09-04',36,'門別'),('2025-09-05',20,'大井'),('2025-09-05',24,'名古屋'),('2025-09-05',27,'園田'),('2025-09-06',31,'高知'),('2025-09-06',32,'佐賀'),('2025-09-07',10,'盛岡'),('2025-09-07',22,'金沢'),('2025-09-07',31,'高知'),('2025-09-07',32,'佐賀'),('2025-09-08',10,'盛岡'),('2025-09-08',21,'川崎'),('2025-09-08',22,'金沢'),('2025-09-09',10,'盛岡'),('2025-09-09',21,'川崎'),('2025-09-09',23,'笠松'),('2025-09-09',36,'門別'),('2025-09-10',21,'川崎'),('2025-09-10',23,'笠松'),('2025-09-10',27,'園田'),('2025-09-10',36,'門別'),('2025-09-11',21,'川崎'),('2025-09-11',23,'笠松'),('2025-09-11',27,'園田'),('2025-09-11',36,'門別'),('2025-09-12',21,'川崎'),('2025-09-12',23,'笠松'),('2025-09-12',27,'園田'),('2025-09-13',22,'金沢'),('2025-09-13',31,'高知'),('2025-09-13',32,'佐賀'),('2025-09-14',11,'水沢'),('2025-09-14',22,'金沢'),('2025-09-14',31,'高知'),('2025-09-14',32,'佐賀'),('2025-09-15',11,'水沢'),('2025-09-15',20,'大井'),('2025-09-15',32,'佐賀'),('2025-09-16',11,'水沢'),('2025-09-16',20,'大井'),('2025-09-16',24,'名古屋'),('2025-09-16',36,'門別'),('2025-09-17',20,'大井'),('2025-09-17',24,'名古屋'),('2025-09-17',27,'園田'),('2025-09-17',36,'門別'),('2025-09-18',20,'大井'),('2025-09-18',24,'名古屋'),('2025-09-18',27,'園田'),('2025-09-18',36,'門別'),('2025-09-19',20,'大井'),('2025-09-19',24,'名古屋'),('2025-09-19',27,'園田'),('2025-09-20',22,'金沢'),('2025-09-20',32,'佐賀'),('2025-09-21',11,'水沢'),('2025-09-21',31,'高知'),('2025-09-21',32,'佐賀'),('2025-09-22',11,'水沢'),('2025-09-22',18,'浦和'),('2025-09-23',11,'水沢'),('2025-09-23',18,'浦和'),('2025-09-23',22,'金沢'),('2025-09-23',23,'笠松'),('2025-09-23',31,'高知'),('2025-09-23',36,'門別'),('2025-09-24',18,'浦和'),('2025-09-24',23,'笠松'),('2025-09-24',27,'園田'),('2025-09-24',36,'門別'),('2025-09-25',18,'浦和'),('2025-09-25',23,'笠松'),('2025-09-25',27,'園田'),('2025-09-25',36,'門別'),('2025-09-26',18,'浦和'),('2025-09-26',23,'笠松'),('2025-09-26',27,'園田'),('2025-09-27',31,'高知'),('2025-09-27',32,'佐賀'),('2025-09-28',11,'水沢'),('2025-09-28',31,'高知'),('2025-09-28',32,'佐賀'),('2025-09-29',11,'水沢'),('2025-09-29',19,'船橋'),('2025-09-29',22,'金沢'),('2025-09-30',11,'水沢'),('2025-09-30',19,'船橋'),('2025-09-30',22,'金沢'),('2025-09-30',24,'名古屋'),('2025-09-30',32,'佐賀'),('2025-09-30',36,'門別');
/*!40000 ALTER TABLE `calendar` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-09-21  6:04:19
